# სხვებს (და საკუთარ თავს მომავალში) გაუადვილებს კოდის გაგებას.
#კოდი გახდება მარტივად შესაცვლელი და გასაუმჯობესებელი.
# სტრუქტურირებული და წესების დაცვით დაწერილი კოდი უფრო ნაკლებ შეცდომას შეიცავს.
#გუნდის წევრებს გაუადვილდებათ ერთობლივი მუშაობა ერთ პროექტზე.



## ორი რიცხვითი ცვლადის შექმნა
num1 = 10
num2 = 5

# მიმატება
#addition = num1 + num2  # ვამატებთ num1-სა და num2-ს
# გამოკლება
#subtraction = num1 - num2  # ვაკლებთ num2-ს num1-ს
# გამრავლება
#multiplication = num1 * num2  # ვამრავლებთ num1-სა და num2-ს
# გაყოფა
#division = num1 / num2  # ვყოფთ num1-ს num2-ზე (წილადი შედეგი)
# მთელი რიცხვით გაყოფა
#floor_division = num1 // num2  # ვყოფთ და ვიღებთ მხოლოდ მთელ რიცხვს




first_name = "Data"  # ცვლადის სახელი უნდა იყოს ერთიანად დაწერილი, სიტყვებს შორის _ გამოვიყენოთ
last_name = "random"  # არ შეიძლება სპეციალური სიმბოლოები, როგორიცაა %



first_user = "Lika"
second_user = "Giorgi"  # ცვლადის სახელები არ უნდა იწყებოდეს რიცხვით
print(first_user)  # სიტყვებს შორის გამოტოვება არ შეიძლება ცვლადის სახელში



Num1 = 20
num2 = 30
print(Num1 + num2)  # გამოიტანს: 50

# ახსნა:
# მიუხედავად იმისა, რომ Num1 და num2 მსგავსია, ისინი განსხვავებული ცვლადებია,
# რადგან Python-ში დიდი და პატარა ასოები მნიშვნელობა აქვს (გრძნობს რიცხვს).
# Num1-ს მნიშვნელობაა 20, ხოლო num2-ს — 30, მათი ჯამი არის 50.
