#python-Python დაპროგრამების ენა შეიქმნა დაახლოებით 1991 წელს ჰოლანდიელის - გვიდო ვან როსუმის მიერ. დაპროგრამების ენის სახელი შერჩეულია ტელესერიალის დასახელების მიხედვით.
# მას შემდეგ, რაც როსუმმა დაამუშავა ენა, მან დადო ინტერნეტში, სადაც მის გასაუმჯობესებლად შემოუერთდა პროგრამისტების მთელი საზოგადოება.  
#Python აქტიურად სრულყოფილი ხდება თანამედროვე პერიოდში. ხშირად გამოდის მისი ახალი ვერსიები. ოფიციალური საიტია http://python.org. 
#Python დაპროგრამების ინტერპრეტირებადი ენაა: საწყისი კოდი შესრულების პროცესში ნაწილებად გარდაიქმნება მანქანურში სპეციალური პროგრამით - ინტერპრეტატორით. 
#Python ხასიათდება ცხადი სინტაქსით. კოდის წაკითხვა მოცემულ ენაზე საკმაოდ მარტივია, რამდენადაც მასში ნაკლებია დამხმარე ელემენტები. კოდი ოპტიმალურია.
# სტანდარტული ბიბლიოთეკა მოიცავს სასარგებლო ფუნქციების დიდ მოცულობას. 
#Python სრულყოფილი, შეიძლება ითქვას დაპროგრამების უნივერსალური ენაა. 
#იგი მხარს უჭერს ობიექტზე ორიენტირებულ პროგრამირებას, უფრო ზუსტად, იგი თავიდანვე დამუშავდა, როგორც ობიექტზე ორიენტირებული ენა. 














#ბრჭყალებში ჩასმული რიცხვი ტერმინალში გამოჩნდება როგორც შეცდომა ხოლო ჩვეულებრი ინტეჯერი კი არა
#მაგალითად:print(7) და print("7")
#print(7 ამ ფორმით ჩაწერილი 7 ჩვეულებრივად გამოჩნდება ტერმინალში
#print("7") ამ ფორმით ჩაწერილი 7 გამოიტანს შეცდომას


num1=36
num2=12
num3=6
num4=3

#Addition
print(num1+num2)  
print(num1+num3)  
print(num1+num4)  
print(num2+num4)
print(num3+num4)

#Substraction
print(num1-num2)
print(num1-num3)
print(num1-num4)
print(num2-num4)
print(num3-num4)

#Multiplication
print(num1*num2)
print(num1*num3)
print(num1*num4)
print(num2*num4)
print(num3*num4)

#Division
print(num1/num2)
print(num1/num3)
print(num1/num4)
print(num2/num4)
print(num3/num4)
